
basic method
============

> rcalendar()
<rcalendar[1900-01-01 / 2100-01-01 / 0 rschedules / 0 rdates / 0 exdates]>

> rcalendar("USA")
<rcalendar[USA / 1900-01-01 / 2100-01-01 / 0 rschedules / 0 rdates / 0 exdates]>


can add holidays
================

> add_rholiday(rcalendar(), hldy_christmas)
<rcalendar[1900-01-01 / 2100-01-01 / 0 rschedules / 0 rdates / 0 exdates]>
- Christmas

> add_rholiday(add_rholiday(rcalendar(), hldy_christmas),
+ hldy_martin_luther_king_jr_day)
<rcalendar[1900-01-01 / 2100-01-01 / 0 rschedules / 0 rdates / 0 exdates]>
- Christmas
- Martin Luther King Jr. Day


can add rschedules / rdates / exdates
=====================================

> add_rschedule(rcalendar(), weekly())
<rcalendar[1900-01-01 / 2100-01-01 / 1 rschedules / 0 rdates / 0 exdates]>

> add_rdate(rcalendar(), "2019-01-01")
<rcalendar[1900-01-01 / 2100-01-01 / 0 rschedules / 1 rdates / 0 exdates]>

> add_exdate(rcalendar(), "2019-01-01")
<rcalendar[1900-01-01 / 2100-01-01 / 0 rschedules / 0 rdates / 1 exdates]>

